src/main/resources/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope 
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ban="http://esmt.banque">
    
    <soap:Header/>
    
    <soap:Body>
        <!-- Opération que tu vas créer (ex: getClientInfo) -->
        <ban:getClientInfo>
            <ban:numeroTel>777777777</ban:numeroTel>
        </ban:getClientInfo>
    </soap:Body>
    
</soap:Envelope>